#**TITANIC SURVIVOR ANALYSIS**

In [ ]:
import pandas as pd
import numpy as np

# **READING DATA USING PANDAS**

We use pandas *read_csv* function to read the csv file in python and pandas *DataFrame* method to convert file into the data frame

In [10]:
import pandas as pd
import numpy as np

df = pd.DataFrame(pd.read_csv('/content/train (1).csv'))
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

# **ATTRIBUTES**

We can extract some information from the panda series Data Frame using some Attribute

In [13]:
import pandas as pd
import numpy as np

df = pd.DataFrame(pd.read_csv('/content/train (1).csv'))
print(df.index)
print()
print(df.columns)
print()
print(df.values)
print()
print("The shape :" + str(df.shape))
print()
print("The size :" + str(df.size))

RangeIndex(start=0, stop=891, step=1)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

[[1 0 3 ... 7.25 nan 'S']
 [2 1 1 ... 71.2833 'C85' 'C']
 [3 1 3 ... 7.925 nan 'S']
 ...
 [889 0 3 ... 23.45 nan 'S']
 [890 1 1 ... 30.0 'C148' 'C']
 [891 0 3 ... 7.75 nan 'Q']]

The shape :(891, 12)

The size :10692

# **HANDELING NULL VALUES**

The dataset may contains many rows and columns for which some values are missing. We can't leave those missing values as it is .
In such cases we have two option:


1.   Either drop the entire row or column
2.   Fill the missing values with some appropriate value let's say mean of all  the values for that column may do the job.

In [50]:
df = pd.DataFrame(pd.read_csv('/content/train (1).csv'))
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

**Separating out the columns which have more than *35 %* of the values *missing* in the dataset**

In [51]:
# df.isnull().sum() returns a pandas series with columns name as the label index
# and total count of null values in the column as it's value
# And we are storing only those columns which have more than 35% of the data missing

#drop_column = df.isnull().sum()[df.isnull().sum()>(35/100  * df.shape[0])]
#print(drop_column)

# can also be done by storing it into a variable
df = pd.DataFrame(pd.read_csv('/content/train (1).csv'))
x=df.isnull().sum()

drop_column = x[x>(35/100  * df.shape[0])]
print()
print(drop_column)

Cabin    687
dtype: int64

# **ANALYSIS USING Index ATTRIBUTE**

In [16]:
drop_column.index

Index(['Cabin'], dtype='object')

In [52]:
df = pd.DataFrame(pd.read_csv('/content/train (1).csv'))
df.drop(drop_column.index, axis=1,inplace = True)
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [53]:
df = pd.DataFrame(pd.read_csv('/content/train (1).csv'))
df.fillna(df.mean(), inplace = True)
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

Because Embarked contains sting values, we see the details of the column separately from  others as strings does not have mean and all

In [45]:
df = pd.DataFrame(pd.read_csv('/content/train (1).csv'))
df['Embarked'].describe()

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

For Embarked attribute , we fill the NULL values with the most frequent value in the column

In [ ]:
df = pd.DataFrame(pd.read_csv('/content/train (1).csv'))
df['Embarked'].fillna('S', inplace = True)

In [44]:
# Now all the NULL values have been FILLED
df = pd.DataFrame(pd.read_csv('/content/train (1).csv'))
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
Ticket         0
Fare           0
Embarked       2
FamilySize     0
dtype: int64

In [54]:
df = pd.DataFrame(pd.read_csv('/content/train (1).csv'))
df.corr()

             PassengerId  Survived    Pclass  ...     SibSp     Parch      Fare
PassengerId     1.000000 -0.005007 -0.035144  ... -0.057527 -0.001652  0.012658
Survived       -0.005007  1.000000 -0.338481  ... -0.035322  0.081629  0.257307
Pclass         -0.035144 -0.338481  1.000000  ...  0.083081  0.018443 -0.549500
Age             0.036847 -0.077221 -0.369226  ... -0.308247 -0.189119  0.096067
SibSp          -0.057527 -0.035322  0.083081  ...  1.000000  0.414838  0.159651
Parch          -0.001652  0.081629  0.018443  ...  0.414838  1.000000  0.216225
Fare            0.012658  0.257307 -0.549500  ...  0.159651  0.216225  1.000000

[7 rows x 7 columns]

**sibsp**: Number of Siblings / Spouses 

**Parch** : Number of Parents / Children Abroad

So we can make a new column family_size by combining these two columns

In [56]:
df = pd.DataFrame(pd.read_csv('/content/train (1).csv'))
df['FamilySize'] = df['SibSp'] + df['Parch']
df.drop(['SibSp','Parch'] , axis=1 , inplace = True)
df.corr()

             PassengerId  Survived    Pclass       Age      Fare  FamilySize
PassengerId     1.000000 -0.005007 -0.035144  0.036847  0.012658   -0.040143
Survived       -0.005007  1.000000 -0.338481 -0.077221  0.257307    0.016639
Pclass         -0.035144 -0.338481  1.000000 -0.369226 -0.549500    0.065997
Age             0.036847 -0.077221 -0.369226  1.000000  0.096067   -0.301914
Fare            0.012658  0.257307 -0.549500  0.096067  1.000000    0.217138
FamilySize     -0.040143  0.016639  0.065997 -0.301914  0.217138    1.000000

Familysize in the ship does not have much correlance with survival rate
**bold text**
Let's check if whether the person was alone or not can affect the survival rate.

In [59]:
df['FamilySize'] = df['SibSp'] + df['Parch']
df['Alone'] = [0 if df['FamilySize'][i]>0 else 1 for i in df.index]
df.head()

   PassengerId  Survived  Pclass  ... Embarked FamilySize  Alone
0            1         0       3  ...        S          1      0
1            2         1       1  ...        C          1      0
2            3         1       3  ...        S          0      1
3            4         1       1  ...        S          1      0
4            5         0       3  ...        S          0      1

[5 rows x 14 columns]

In [62]:
df.groupby(['Alone'])['Survived'].mean()

Alone
0    0.505650
1    0.303538
Name: Survived, dtype: float64

If the person is alone he/she has less chance of surviving


> The reason might be the person who is traveling with his family might be belonging to rich class and might be prioritized over other.

In [ ]:
df[['Alone', 'Fare']].corr()

So we can see if the person was not alone , the chance the ticket price is higher is high

In [ ]:
df['Sex'] = [0 if df['Sex'][i]=='male' else 1 for i in df.index] 
# 1 for female and 0 for male
df.groupby(['Sex'])['Survived'].mean()

It shows , Female passengers have more chance of surviving than male ones

It shows women were prioritized over men.

In [65]:
df.groupby(['Embarked'])['Survived'].mean()

Embarked
C    0.553571
Q    0.389610
S    0.336957
Name: Survived, dtype: float64

# **CONCLUSION**



*   Female passengers were prioritized over men.
*   People with high class or rich people have gigher survival rate than others. The hierarchy might have bess followed while saving the passengers.
*   Passengers traveling with their family have higher survival rate.
*   Passengers who borded the ship at Cherbourg , survived more in proportion then the others.